hw3/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-09-06 Sun 10:24 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>PPL &#x2013; Homework 3</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">PPL &#x2013; Homework 3</h1>
</header><hr >

<div class="abstract">
<p>
We study the sementic meaning of one of the basic element: the
variable.  Concepts of binding and scoping are especially important
for using a language.
</p>

</div>

<ol class="org-ol">
<li>(<b>10 points</b>) Dynamic type binding is closely related to implicit
heap dynamic variables.  Explain this relationship.</li>
<li><p>
(<b>40 points</b>) Consider the following Javascript snippets.
</p>

<div class="org-src-container">

<pre class="src src-javascript">(<span style="color: #729fcf; font-weight: bold;">function</span>() {

    <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #ff2929;">x</span> = -1;

    <span style="color: #729fcf; font-weight: bold;">function</span> <span style="color: #fcaf3e; font-weight: bold;">sub1</span>() {
        <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #ff2929;">x</span> = 1;

        <span style="color: #729fcf; font-weight: bold;">function</span> <span style="color: #fcaf3e; font-weight: bold;">sub2</span>() {
            console.log(x);
            sub3();
        }

        sub2();
    }

    <span style="color: #729fcf; font-weight: bold;">function</span> <span style="color: #fcaf3e; font-weight: bold;">sub3</span>() {
        console.log(x);
    }

    <span style="color: #729fcf; font-weight: bold;">function</span> <span style="color: #fcaf3e; font-weight: bold;">sub4</span>() {
        <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #ff2929;">x</span> = 1;
        sub3();
    }

    sub1();                     <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">call 1</span>
    sub3();                     <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">call 2</span>
    sub4();                     <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">call 3</span>

})();
</pre>
</div>

<p>
What the output would be of <code>call 1</code>, <code>call 2</code> and <code>call 3</code>
respectively if
</p>

<ul class="org-ul">
<li>assuming static scoping</li>
<li>assuming dynamic scoping</li>
</ul></li>

<li>(<b>20 points</b>) For the language C++, give as precise binding times
as you can for the following attributes.  Explain your answer.

<ul class="org-ul">
<li>the maximum of significant digits in a real number.</li>
<li>the meaining of <code>char</code>.</li>
<li>the size of an array variable.</li>
<li>the size of an array parameter.</li>
<li>the location of a local variable.</li>
<li>the value of a constant.</li>
<li>the location of a function.</li>
</ul></li>

<li>(<b>10 points</b>) Discuss the relative advantanges of early binding and
late binding.</li>
</ol>

<hr >
</div>
<div id="postamble" class="status">
<a class="author"
         href="http://gongzhitaao.org">Zhitao Gong</a> / <span
         class="date">2015-09-06 Sun 10:24</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
